// ****************************************************************************
// *** ページ共通処理
// ***   ページ初期表示制御
// ***   各イベント処理
// ****************************************************************************

$(function() {

	// ************************************************************************
	// ページトップ移動処理
	// ************************************************************************

//読込み時はページトップボタンを非表示に
    var topBtn = $('#page-top');
    topBtn.hide();
    //スクロールが100に達したらボタン表示
    $(window).scroll(function () {
        if ($(this).scrollTop() > 100) {
            topBtn.fadeIn();
        } else {
            topBtn.fadeOut();
        }
    });
    //スクロールしてトップ
    topBtn.click(function () {
        $('body,html').animate({
            scrollTop: 0
        }, 500);
        return false;
    });

});
